api/controllers/MagangController.php

SELECT COUNT(*) FROM `tbl_magang` `mag` LEFT JOIN `tbl_bagian` `bag` ON mag.bagian = bag.kd_bagian WHERE `no_magang` IN ('MG00044', 'MG00045', 'MG00046', 'MG00047', 'MG00048', 'MG00049', 'MG00050', 'MG00051', 'MG00052', 'MG00053', 'MG00054', 'MG00055', 'MG00056', 'MG00057', 'MG00058', 'MG00059', 'MG00060') ORDER BY `mag`.`no_magang` DESC
---
    public function actionRekap() {
        //init variable
        $params = json_decode(file_get_contents("php://input"), true);
        $filter = array();
        $sort = "mag.no_magang DESC";
        $offset = 0;
        $limit = 10;
        $starts = date('Y-m-d', strtotime($params['tanggal']['startDate']));
        $ends = date('Y-m-d', strtotime($params['tanggal']['startDate']));
        $siswa_magang = $this->ceksiswa($starts, $ends);

        //create query
        $query = new Query;
        $query->from('tbl_magang as mag')
                ->join('LEFT JOIN', 'tbl_bagian as bag', 'mag.bagian = bag.kd_bagian')
                ->where(['in', 'no_magang', $siswa_magang])
//                ->offset($offset)
//                ->limit($limit)
                ->orderBy($sort)
                ->select("*");

        session_start();
        $_SESSION['query'] = $query;
        $_SESSION['params'] = $params;

        $command = $query->createCommand();
        $models = $command->queryAll();
        $totalItems = $query->count();

SELECT * FROM `tbl_magang`
---
    public function cekid($tanggal) {
///
        $model = Tblmagang::find()->all();