api/controllers/SiteController.php

SELECT * FROM `tbl_user` WHERE (`username`='admin') AND (`password`='badf049d8104384c090f1678053bc4cbf0f9b0fb')
---
    public function actionLogin() {
        $params = json_decode(file_get_contents("php://input"), true);
        $model = User::find()->where(['username' => $params['username'], 'password' => sha1($params['password'])])->one();